[TC_WOTC_S79_C7_T1 X2WeaponTemplate]
FriendlyName="<font color='#ECECEC'><b>C7</b></font>"
FriendlyNamePlural="<font color='#ECECEC'><b>C7</b></font>"
AbilityDescName="винтовка"
BriefSummary="Кольт Канада, также известный как  Diemaco C7 / C8 - канадские автоматы, являющиеся модифицированными вариантами американских автоматов М16А1 и M4 соответственно. Основные отличия C7 от М16А1 — ствол, аналогичный М16А2 (соответствующий патронам SS109, а не M193), и упрощенный диоптрический прицел, имеющий две установки по дальности. Вместо ручки для переноски установлена интегральная направляющая типа планки Пикантинни."
TacticalText=""<Bullet/>Тип: Винтовка\n<Bullet/>Режим ведения огня: Очередь в три патрона\n<Bullet/>Принцип действия: Отвод пороховых газов, Поворотный затвор (самозарядный)\n<Bullet/>Тип боеприпаса: 5.56x45мм НАТО\n<Bullet/>Страна производитель: Канада\n<Bullet/>Уровень технологии: Базовое оружие"

[TC_WOTC_S79_C7_T2 X2WeaponTemplate]
FriendlyName="<font color='#27AAE1'><b>KC7 Custom</b></font>"
FriendlyNamePlural="<font color='#27AAE1'><b>YCS/C7</b></font>"
AbilityDescName="винтовка"
BriefSummary="Кольт Канада, также известный как  Diemaco C7 / C8 - канадские автоматы, являющиеся модифицированными вариантами американских автоматов М16А1 и M4 соответственно. Основные отличия C7 от М16А1 — ствол, аналогичный М16А2 (соответствующий патронам SS109, а не M193), и упрощенный диоптрический прицел, имеющий две установки по дальности. Вместо ручки для переноски установлена интегральная направляющая типа планки Пикантинни.\nKC7 является модификацией винтовки C7 в соответствии с технологиями магнитного оружия, большая часть деталей, которой,  была заменена на детали, изготовленные из инопланетных сплавов, что существенно повысило баллистический профиль данного образца, обеспечивая намного лучшую точность и высокие наносимые повреждения."
TacticalText=""<Bullet/>Тип: Винтовка\n<Bullet/>Режим ведения огня: Очередь в три патрона\n<Bullet/>Принцип действия: Отвод пороховых газов, Поворотный затвор (самозарядный)\n<Bullet/>Тип боеприпаса: 5.56x45мм НАТО\n<Bullet/>Страна производитель: Канада\n<Bullet/>Уровень технологии: Магнитное оружие"

[TC_WOTC_S79_C7_T3 X2WeaponTemplate]
FriendlyName="<font color='#CF4517'><b>KC7-32</b></font>"
FriendlyNamePlural="<font color='#CF4517'><b>KC7-32</b></font>"
AbilityDescName="винтовка"
BriefSummary="Кольт Канада, также известный как  Diemaco C7 / C8 - канадские автоматы, являющиеся модифицированными вариантами американских автоматов М16А1 и M4 соответственно. Основные отличия C7 от М16А1 — ствол, аналогичный М16А2 (соответствующий патронам SS109, а не M193), и упрощенный диоптрический прицел, имеющий две установки по дальности. Вместо ручки для переноски установлена интегральная направляющая типа планки Пикантинни.\nСтвол KC7 был заменен специальным высокочастотным цилиндром, позволяющим пулям достигать сверхзвуковых скоростей, снижая отдачу оружия."
TacticalText=""<Bullet/>Тип: Винтовка\n<Bullet/>Режим ведения огня: Очередь в три патрона\n<Bullet/>Принцип действия: Отвод пороховых газов, Поворотный затвор (самозарядный)\n<Bullet/>Тип боеприпаса: 5.56x45мм НАТО\n<Bullet/>Страна производитель: Канада\n<Bullet/>Уровень технологии: Лучевое оружие"

[TC_WOTC_SKR_S79_C7_T1 X2WeaponTemplate]
FriendlyName="<font color='#ECECEC'><b>C7</b></font>"
FriendlyNamePlural="<font color='#ECECEC'><b>C7</b></font>"
AbilityDescName="винтовка"
BriefSummary="Кольт Канада, также известный как  Diemaco C7 / C8 - канадские автоматы, являющиеся модифицированными вариантами американских автоматов М16А1 и M4 соответственно. Основные отличия C7 от М16А1 — ствол, аналогичный М16А2 (соответствующий патронам SS109, а не M193), и упрощенный диоптрический прицел, имеющий две установки по дальности. Вместо ручки для переноски установлена интегральная направляющая типа планки Пикантинни."
TacticalText=""<Bullet/>Тип: Винтовка\n<Bullet/>Режим ведения огня: Очередь в три патрона\n<Bullet/>Принцип действия: Отвод пороховых газов, Поворотный затвор (самозарядный)\n<Bullet/>Тип боеприпаса: 5.56x45мм НАТО\n<Bullet/>Страна производитель: Канада\n<Bullet/>Уровень технологии: Базовое оружие"

[TC_WOTC_SKR_S79_C7_T2 X2WeaponTemplate]
FriendlyName="<font color='#27AAE1'><b>KC7 Custom</b></font>"
FriendlyNamePlural="<font color='#27AAE1'><b>YCS/C7</b></font>"
AbilityDescName="винтовка"
BriefSummary="Кольт Канада, также известный как  Diemaco C7 / C8 - канадские автоматы, являющиеся модифицированными вариантами американских автоматов М16А1 и M4 соответственно. Основные отличия C7 от М16А1 — ствол, аналогичный М16А2 (соответствующий патронам SS109, а не M193), и упрощенный диоптрический прицел, имеющий две установки по дальности. Вместо ручки для переноски установлена интегральная направляющая типа планки Пикантинни.\nKC7 является модификацией винтовки C7 в соответствии с технологиями магнитного оружия, большая часть деталей, которой,  была заменена на детали, изготовленные из инопланетных сплавов, что существенно повысило баллистический профиль данного образца, обеспечивая намного лучшую точность и высокие наносимые повреждения."
TacticalText=""<Bullet/>Тип: Винтовка\n<Bullet/>Режим ведения огня: Очередь в три патрона\n<Bullet/>Принцип действия: Отвод пороховых газов, Поворотный затвор (самозарядный)\n<Bullet/>Тип боеприпаса: 5.56x45мм НАТО\n<Bullet/>Страна производитель: Канада\n<Bullet/>Уровень технологии: Магнитное оружие"

[TC_WOTC_SKR_S79_C7_T3 X2WeaponTemplate]
FriendlyName="<font color='#CF4517'><b>KC7-32</b></font>"
FriendlyNamePlural="<font color='#CF4517'><b>KC7-32</b></font>"
AbilityDescName="винтовка"
BriefSummary="Кольт Канада, также известный как  Diemaco C7 / C8 - канадские автоматы, являющиеся модифицированными вариантами американских автоматов М16А1 и M4 соответственно. Основные отличия C7 от М16А1 — ствол, аналогичный М16А2 (соответствующий патронам SS109, а не M193), и упрощенный диоптрический прицел, имеющий две установки по дальности. Вместо ручки для переноски установлена интегральная направляющая типа планки Пикантинни.\nСтвол KC7 был заменен специальным высокочастотным цилиндром, позволяющим пулям достигать сверхзвуковых скоростей, снижая отдачу оружия."
TacticalText=""<Bullet/>Тип: Винтовка\n<Bullet/>Режим ведения огня: Очередь в три патрона\n<Bullet/>Принцип действия: Отвод пороховых газов, Поворотный затвор (самозарядный)\n<Bullet/>Тип боеприпаса: 5.56x45мм НАТО\n<Bullet/>Страна производитель: Канада\n<Bullet/>Уровень технологии: Лучевое оружие"